#ifndef GUARD_YGO_H
#define GUARD_YGO_H

struct CardInfo
{
    /* 0x00 */ const u8 *name;
    /* 0x04 */ const u8 *nameShort;
    /* 0x08 */ const u8 *description;
    /* 0x0C */ const u8 password[9];
    /* 0x14 */ const u32 *pic;
    /* 0x18 */ const u16 *pal;
    /* 0x1C */ const u32 *iconSquare;
    /* 0x20 */ const u32 *iconLarge;
    /* 0x24 */ const u32 *iconSmall;
    /* 0x28 */ u16 effects[8];
    /* 0x38 */ u32 type:5;
    /* 0x38 */ u32 attribute:3;
    /* 0x39 */ u32 level:4;
    /* 0x39 */ u32 atk:9;
    /* 0x3A */ u32 def:9;
    /* 0x3C */ u8 race;
    /* 0x3D */ u8 unused1;
    /* 0x3E */ u16 id;
    /* 0x40 */ u16 archetypesSeries[3];
    /* 0x46 */ u16 unused2;
    /* 0x48 */ u32 priceYK:10;
    /* 0x49 */ u32 priceCritter:10;
    /* 0x4A */ u32 priceTreasure:10;
    /* 0x4C */ u32 priceImperial:10;
    /* 0x4D */ u32 priceAndroid:10;
    /* 0x4E */ u32 priceJoeyPegasus:10;
    /* 0x50 */ u32 priceFiber:10;
    /* 0x51 */ u32 priceYata:10;
    /* 0x52 */ u32 priceScientist:10;
    /* 0x54 */ u32 priceVampire:10;
    /* 0x55 */ u32 priceChaos:10;
    /* 0x56 */ u32 priceWarrior:10;
    /* 0x58 */ u32 priceGoat:10;
    /* 0x59 */ u32 priceCyber:10;
    /* 0x5A */ u32 priceReaper:10;
    /* 0x5C */ u32 price1:10;
    /* 0x5D */ u32 price2:10;
    /* 0x5E */ u32 price3:10;
};

extern const struct CardInfo gCardInfo[];
extern const u8 gCardDescription_4StarredLadybugofDoom[];
extern const u8 gCardDescription_7ColoredFish[];
extern const u8 gCardDescription_AirknightParshath[];
extern const u8 gCardDescription_AquaMadoor[];
extern const u8 gCardDescription_ArmedDragonLV5[];
extern const u8 gCardDescription_AsuraPriest[];
extern const u8 gCardDescription_BanisheroftheLight[];
extern const u8 gCardDescription_BattleOx[];
extern const u8 gCardDescription_BazootheSoulEater[];
extern const u8 gCardDescription_Bickuribox[];
extern const u8 gCardDescription_BlackLusterSoldier[];
extern const u8 gCardDescription_BlackSkullDragon[];
extern const u8 gCardDescription_BlastwithChain[];
extern const u8 gCardDescription_BlueEyesWhiteDragon[];
extern const u8 gCardDescription_BookofMoon[];
extern const u8 gCardDescription_BusterBlader[];
extern const u8 gCardDescription_CalloftheHaunted[];
extern const u8 gCardDescription_CannonSoldier[];
extern const u8 gCardDescription_Ceasefire[];
extern const u8 gCardDescription_ChangeofHeart[];
extern const u8 gCardDescription_Confiscation[];
extern const u8 gCardDescription_CrassClown[];
extern const u8 gCardDescription_CreatureSwap[];
extern const u8 gCardDescription_CyberJar[];
extern const u8 gCardDescription_DarkBaltertheTerrible[];
extern const u8 gCardDescription_DarkElf[];
extern const u8 gCardDescription_DarkHole[];
extern const u8 gCardDescription_DarkMagician[];
extern const u8 gCardDescription_DarkNecrofear[];
extern const u8 gCardDescription_DarkRulerHaDes[];
extern const u8 gCardDescription_DelinquentDuo[];
extern const u8 gCardDescription_DonZaloog[];
extern const u8 gCardDescription_DreamClown[];
extern const u8 gCardDescription_DustTornado[];
extern const u8 gCardDescription_Exchange[];
extern const u8 gCardDescription_ExiledForce[];
extern const u8 gCardDescription_ExodiatheForbiddenOne[];
extern const u8 gCardDescription_FiberJar[];
extern const u8 gCardDescription_Fissure[];
extern const u8 gCardDescription_FlameSwordsman[];
extern const u8 gCardDescription_GaiatheDragonChampion[];
extern const u8 gCardDescription_GaiaTheFierceKnight[];
extern const u8 gCardDescription_GeminiElf[];
extern const u8 gCardDescription_GiantGerm[];
extern const u8 gCardDescription_GiantRat[];
extern const u8 gCardDescription_GiantSoldierofStone[];
extern const u8 gCardDescription_GiantTrunade[];
extern const u8 gCardDescription_GigaTechWolf[];
extern const u8 gCardDescription_GoblinAttackForce[];
extern const u8 gCardDescription_GracefulCharity[];
extern const u8 gCardDescription_GranmargtheRockMonarch[];
extern const u8 gCardDescription_GravekeepersAssailant[];
extern const u8 gCardDescription_GravekeepersSpearSoldier[];
extern const u8 gCardDescription_GravekeepersSpy[];
extern const u8 gCardDescription_HarpiesFeatherDuster[];
extern const u8 gCardDescription_HeavyStorm[];
extern const u8 gCardDescription_ImperialOrder[];
extern const u8 gCardDescription_InjectionFairyLily[];
extern const u8 gCardDescription_JarofGreed[];
extern const u8 gCardDescription_Jinzo[];
extern const u8 gCardDescription_JiraiGumo[];
extern const u8 gCardDescription_JudgeMan[];
extern const u8 gCardDescription_JustDesserts[];
extern const u8 gCardDescription_KingTigerWanghu[];
extern const u8 gCardDescription_Kuriboh[];
extern const u8 gCardDescription_KycootheGhostDestroyer[];
extern const u8 gCardDescription_LaJinntheMysticalGenieoftheLamp[];
extern const u8 gCardDescription_LabyrinthTank[];
extern const u8 gCardDescription_LastWill[];
extern const u8 gCardDescription_LeftArmoftheForbiddenOne[];
extern const u8 gCardDescription_LeftLegoftheForbiddenOne[];
extern const u8 gCardDescription_MagicCylinder[];
extern const u8 gCardDescription_MagicJammer[];
extern const u8 gCardDescription_MagicianofFaith[];
extern const u8 gCardDescription_ManEaterBug[];
extern const u8 gCardDescription_MaskofDarkness[];
extern const u8 gCardDescription_MaskedSorcerer[];
extern const u8 gCardDescription_Mechanicalchaser[];
extern const u8 gCardDescription_Metamorphosis[];
extern const u8 gCardDescription_MirageofNightmare[];
extern const u8 gCardDescription_MirrorForce[];
extern const u8 gCardDescription_MobiustheFrostMonarch[];
extern const u8 gCardDescription_MonsterReborn[];
extern const u8 gCardDescription_MorphingJar[];
extern const u8 gCardDescription_MukaMuka[];
extern const u8 gCardDescription_MysticTomato[];
extern const u8 gCardDescription_MysticalElf[];
extern const u8 gCardDescription_Necrovalley[];
extern const u8 gCardDescription_NeotheMagicSwordsman[];
extern const u8 gCardDescription_NightmareWheel[];
extern const u8 gCardDescription_NimbleMomonga[];
extern const u8 gCardDescription_NoblemanofCrossout[];
extern const u8 gCardDescription_Ookazi[];
extern const u8 gCardDescription_PainfulChoice[];
extern const u8 gCardDescription_PenguinKnight[];
extern const u8 gCardDescription_Polymerization[];
extern const u8 gCardDescription_PotofGreed[];
extern const u8 gCardDescription_PrematureBurial[];
extern const u8 gCardDescription_Raigeki[];
extern const u8 gCardDescription_ReaperontheNightmare[];
extern const u8 gCardDescription_RedEyesBlackDragon[];
extern const u8 gCardDescription_Reinforcements[];
extern const u8 gCardDescription_RightArmoftheForbiddenOne[];
extern const u8 gCardDescription_RightLegoftheForbiddenOne[];
extern const u8 gCardDescription_RingofDestruction[];
extern const u8 gCardDescription_RobbinGoblin[];
extern const u8 gCardDescription_RushRecklessly[];
extern const u8 gCardDescription_RyuSenshi[];
extern const u8 gCardDescription_SacredPhoenixofNephthys[];
extern const u8 gCardDescription_Sangan[];
extern const u8 gCardDescription_SevenToolsoftheBandit[];
extern const u8 gCardDescription_SinisterSerpent[];
extern const u8 gCardDescription_SkullKnight[];
extern const u8 gCardDescription_SkullLair[];
extern const u8 gCardDescription_SnatchSteal[];
extern const u8 gCardDescription_SolemnJudgment[];
extern const u8 gCardDescription_SolemnWishes[];
extern const u8 gCardDescription_SoulExchange[];
extern const u8 gCardDescription_SpearDragon[];
extern const u8 gCardDescription_SpiritReaper[];
extern const u8 gCardDescription_StJoan[];
extern const u8 gCardDescription_SummonedSkull[];
extern const u8 gCardDescription_SwordsofRevealingLight[];
extern const u8 gCardDescription_TheFiendMegacyber[];
extern const u8 gCardDescription_TheForcefulSentry[];
extern const u8 gCardDescription_TheLastWarriorfromAnotherPlanet[];
extern const u8 gCardDescription_ThestalostheFirestormMonarch[];
extern const u8 gCardDescription_ThousandEyesRestrict[];
extern const u8 gCardDescription_ThunderDragon[];
extern const u8 gCardDescription_TimeSeal[];
extern const u8 gCardDescription_TorrentialTribute[];
extern const u8 gCardDescription_TrapHole[];
extern const u8 gCardDescription_TributetotheDoomed[];
extern const u8 gCardDescription_TwinHeadedThunderDragon[];
extern const u8 gCardDescription_UltimateOffering[];
extern const u8 gCardDescription_UnitedWeStand[];
extern const u8 gCardDescription_UpstartGoblin[];
extern const u8 gCardDescription_Waboku[];
extern const u8 gCardDescription_WallofIllusion[];
extern const u8 gCardDescription_WhiteMagicalHat[];
extern const u8 gCardDescription_WitchoftheBlackForest[];
extern const u8 gCardDescription_YataGarasu[];
extern const u8 gCardDescription_ZombyratheDark[];
extern const u8 CardIdMapping[];

#endif // GUARD_YGO_H
