#ifndef GUARD_YGO_H
#define GUARD_YGO_H

struct CardInfo
{
    /* 0x00 */ const u8 *name;
    /* 0x04 */ const u8 *nameShort;
    /* 0x08 */ const u8 *nameShortBag;
    /* 0x0C */ const u8 *description;
    /* 0x10 */ const u8 password[12];
    /* 0x1C */ const u32 *pic;
    /* 0x20 */ const u16 *pal;
    /* 0x24 */ const u32 *iconSquare;
    /* 0x28 */ const u32 *iconSmall;
    /* 0x2C */ const u32 *palIconSmall;
    /* 0x30 */ const u32 *iconTiny;
    /* 0x34 */ const u32 *palIconTiny;
    /* 0x38 */ u16 effects[8];
    /* 0x48 */ u32 type:5;
    /* 0x48 */ u32 attribute:3;
    /* 0x49 */ u32 level:4;
    /* 0x49 */ u32 atk:9;
    /* 0x4A */ u32 def:9;
    /* 0x4C */ u8 race;
    /* 0x4D */ u8 unused1;
    /* 0x4E */ u16 id;
    /* 0x50 */ u16 archetypesSeries[3];
    /* 0x56 */ u16 unused2;
    /* 0x58 */ u32 priceYK:10;
    /* 0x59 */ u32 priceCritter:10;
    /* 0x5A */ u32 priceTreasure:10;
    /* 0x5C */ u32 priceImperial:10;
    /* 0x5D */ u32 priceAndroid:10;
    /* 0x5E */ u32 priceJoeyPegasus:10;
    /* 0x60 */ u32 priceFiber:10;
    /* 0x61 */ u32 priceYata:10;
    /* 0x62 */ u32 priceScientist:10;
    /* 0x64 */ u32 priceVampire:10;
    /* 0x65 */ u32 priceChaos:10;
    /* 0x66 */ u32 priceWarrior:10;
    /* 0x68 */ u32 priceGoat:10;
    /* 0x69 */ u32 priceCyber:10;
    /* 0x6A */ u32 priceReaper:10;
    /* 0x6C */ u32 priceChaosReturn:10;
    /* 0x6D */ u32 priceDemise:10;
    /* 0x6E */ u32 priceTrooper:10;
    /* 0x70 */ u32 priceZombie:10;
    /* 0x71 */ u32 pricePerfectCircle:10;
    /* 0x72 */ u32 priceDADReturn:10;
    /* 0x74 */ u32 priceGladiator:10;
    /* 0x75 */ u32 priceTeleDAD:10;
    /* 0x76 */ u32 priceCat:10;
    /* 0x78 */ u32 priceEdison:10;
    /* 0x79 */ u32 priceFrog:10;
    /* 0x7A */ u32 priceStarstrike:10;
    /* 0x7C */ u32 priceTengu:10;
    /* 0x7D */ u32 priceDinoRabbit:10;
    /* 0x7E */ u32 priceWindUp:10;
    /* 0x80 */ u32 priceMiami:10;
    /* 0x81 */ u32 priceMeadowlands:10;
    /* 0x82 */ u32 priceBabyRuler:10;
    /* 0x84 */ u32 priceRavineRuler:10;
    /* 0x85 */ u32 priceFireWater:10;
    /* 0x86 */ u32 priceHAT:10;
    /* 0x88 */ u32 priceVegas:10;
    /* 0x89 */ u32 priceWCT06:10;
    /* 0x8A */ u32 priceCustom:10;
    /* 0x8C */ u32 priceVendor1:10;
    /* 0x8D */ u32 priceVendor2:10;
    /* 0x8E */ u32 priceVendor3:10;
    /* 0x90 */ u32 banYK:2;
    /* 0x90 */ u32 banCritter:2;
    /* 0x90 */ u32 banTreasure:2;
    /* 0x90 */ u32 banImperial:2;
    /* 0x91 */ u32 banAndroid:2;
    /* 0x91 */ u32 banJoeyPegasus:2;
    /* 0x91 */ u32 banFiber:2;
    /* 0x92 */ u32 banYata:2;
    /* 0x92 */ u32 banScientist:2;
    /* 0x92 */ u32 banVampire:2;
    /* 0x92 */ u32 banChaos:2;
    /* 0x93 */ u32 banWarrior:2;
    /* 0x93 */ u32 banGoat:2;
    /* 0x93 */ u32 banCyber:2;
    /* 0x93 */ u32 banReaper:2;
    /* 0x94 */ u32 banChaosReturn:2;
    /* 0x94 */ u32 banDemise:2;
    /* 0x94 */ u32 banTrooper:2;
    /* 0x94 */ u32 banZombie:2;
    /* 0x95 */ u32 banPerfectCircle:2;
    /* 0x95 */ u32 banDADReturn:2;
    /* 0x95 */ u32 banGladiator:2;
    /* 0x95 */ u32 banTeleDAD:2;
    /* 0x96 */ u32 banCat:2;
    /* 0x96 */ u32 banEdison:2;
    /* 0x96 */ u32 banFrog:2;
    /* 0x96 */ u32 banStarstrike:2;
    /* 0x97 */ u32 banTengu:2;
    /* 0x97 */ u32 banDinoRabbit:2;
    /* 0x97 */ u32 banWindUp:2;
    /* 0x97 */ u32 banMiami:2;
    /* 0x98 */ u32 banMeadowlands:2;
    /* 0x98 */ u32 banBabyRuler:2;
    /* 0x98 */ u32 banRavineRuler:2;
    /* 0x98 */ u32 banFireWater:2;
    /* 0x99 */ u32 banHAT:2;
    /* 0x99 */ u32 banVegas:2;
    /* 0x99 */ u32 banWCT06:2;
    /* 0x99 */ u32 banCustom:2;
    /* 0x9A */ u32 banVendor1:2;
    /* 0x9A */ u32 banVendor2:2;
    /* 0x9A */ u32 banVendor3:2;
};

struct PackContents
{
    u16 card;
    u8 rarity;
};

struct Pack
{
    const struct PackContents *pack;
    u16 length;
};

extern const struct Pack gPacks[];
extern const struct CardInfo gCardInfo[];
extern const u8 gCardDescription_4StarredLadybugofDoom[];
extern const u8 gCardDescription_7ColoredFish[];
extern const u8 gCardDescription_ALegendaryOcean[];
extern const u8 gCardDescription_ABCDragonBuster[];
extern const u8 gCardDescription_AbyssDweller[];
extern const u8 gCardDescription_AbyssSoldier[];
extern const u8 gCardDescription_Abysssphere[];
extern const u8 gCardDescription_AdvancedRitualArt[];
extern const u8 gCardDescription_AgidotheAncientSentinel[];
extern const u8 gCardDescription_AirknightParshath[];
extern const u8 gCardDescription_AlbaLenatustheAbyssDragon[];
extern const u8 gCardDescription_AlbaztheAshen[];
extern const u8 gCardDescription_AlbiontheSanctifireDragon[];
extern const u8 gCardDescription_AlbiontheShroudedDragon[];
